update mermaid diagrams to plantuml
